Autodesk.Revit.DB.Structure.BendingDetailInternals.GetTickMarkGeometry(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.DimensionType,System.Double,Autodesk.Revit.DB.ElementId)
Creates the tick mark specified buy the input dimension type.
dbView:
The view that has the dimension.
position:
The position of the TickMark.
direction:
The direction of the line on which the tick mark will stay.
normal:
The normal of the plane in this the tick mark will stay
dimenstionType:
The dimsion type.
modelToSheetScale:
A scale that will be applied to the text. Ususally it is the view scale.
graphicStyleId:
The graphic sttyle that will be set on the entre GGroup.
Returns:
Returns a GGroup which contins the tick mark graphics.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.TransformGNode(Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.GeometryObject)
Apply the transformation to the input GNode
transform:
The transformation
gNodeToTransform:
The GNode that would be transformed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.MoveTextAtTheEndOfLine(Autodesk.Revit.DB.Line,System.Int32,Autodesk.Revit.DB.GeometryObject)
It will move the text at the specified end of the line.
line:
The Line
lineEnd:
The end of the line.
groupWithTexts:
The GGroup node with texts that would be transformed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.MoveTextWithVec(Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.GeometryObject)
It will move the text with the specified vector plus (only if addHalfOfWidth is true) half of the text width in the same direction as the specified vector.
moveVec:
The movement vector.
addHalfOfWidth:
If true, will add half of width in the direction of moveVec.
groupWithTexts:
The GGroup node with texts that would be transformed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.AlterDimensionGraphics(System.Boolean,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ,System.String,System.String,Autodesk.Revit.DB.Document,System.Double,System.Boolean,Autodesk.Revit.DB.GeometryObject)
It will replace the text's content with contentText (if is not an empty string).
If the text generated by the dimension is between the bar segment and dimension extension curve (line/arc), it will be moved on the other part of the dimension extension curve (line/arc).
If contentAlternateText is non empty, a new text with this string as content will be created on the other part of the dimension extension curve
If removeAllButText, the returned graphics will contin just the texts
adjustTextSide:
If true, it will calcualte if the text is "inside" the dimension using outsideDir. If it's inside it will be moved on the opposite part.
dimensionExtensionCurve:
The dimension extension curve (line/arc).
outsideDir:
The direction which means that is "outside" of the segment.
Starting from the segment in this direction it should be the dimension extension curve (line/arc) and than the text.
contentText:
The new content for the text that already exists in the dimension geometry .
contentAlternateText:
If this is non empty, a text on the oppsite part of the dimenion extendion curve will be created.
document:
The Document which was used to compute the dimension's geometry.
modelToSheetScale:
1 / The view scale.
removeAllButText:
If this is true, only the texts from dimenion grapics will be returned.
dimensionGeometry:
The geometry of the dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.GetTextWidth(Autodesk.Revit.DB.GeometryObject)
pTextGNode:
The GText.
Returns:
Returns the width of the text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals.CreateTextGeometryObject(System.String,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.Double,Autodesk.Revit.DB.Color,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.HorizontalTextAlignment,Autodesk.Revit.DB.VerticalTextAlignment)
Creates a GeomtryObject that is a text.
This function should be removed and GRichText class should be exposed to API.
Keep in mind that GText is still present in Revit. Maybe the APIText class should wrap both GRichText and GText
text:
The content of the text.
document:
The document that contains element which has the properties of the text.
textStyleOwnerId:
The id of the element from which the text properties were taken.
fontName:
The name of the text font.
height:
Height [ft] of the area of the text content in model space.
fontColor:
The color of the text. RGB value of the color.
modelToSheetScale:
A scale that will be applied to the text. Ususally it is the view scale.
position:
Position of the text in model coordinates.
baseDirection:
Direction of the base line of the text object in model space.
upDirection:
Direction along the vertical axis of letters of the text object in model space.
horizontalAlignment:
Indicates default horizontal alignment of the text.
verticalAlignment:
Indicates default vertical alignment of the text.
Returns:
Returns the newly created GeometryObject that is a text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.BendingDetailInternals.ComputeOutlineInView(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.View)
This method computes the Outline of the provided GeometryElement in view.
Returns true if the outline was computed successfully and false otherwise.
geometryObject:
The geometry object to compute outline.
dbView:
The view in which the outline is computed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.BendingDetailInternals
Static utility class with public_api_internal methods needed for bending detail computation.
This functions should be exposed to API in a way or another.